tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "koekeishiya/formulae"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Rsync for cloud storage
brew "rclone"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Terminal multiplexer
brew "tmux"
# JavaScript package manager
brew "yarn"
# Tracks most-used directories to make cd smarter
brew "z"
# UNIX shell (command interpreter)
brew "zsh"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
cask "font-hack-nerd-font"
cask "insomnia"
cask "ngrok"
cask "react-native-debugger"
cask "wine-stable"
cask "xquartz"
