tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "koekeishiya/formulae"
tap "zero-sh/tap"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Configurable static site generator
brew "hugo"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Rsync for cloud storage
brew "rclone"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# JavaScript package manager
brew "yarn"
# Tracks most-used directories to make cd smarter
brew "z"
# UNIX shell (command interpreter)
brew "zsh"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Small tool to set macOS user defaults from a YAML file
brew "zero-sh/tap/apply-user-defaults"
# Radically simple personal bootstrapping tool for macOS
brew "zero-sh/tap/zero"
cask "blackhole"
cask "discord"
cask "firefox"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "insomnia"
cask "iterm2"
cask "ngrok"
cask "react-native-debugger"
cask "spotify"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "wine-stable"
cask "xquartz"
mas "1Blocker", id: 1107421413
mas "Bear", id: 1091189122
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "myHomework", id: 970610831
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Surfshark", id: 1437809329
mas "Xcode", id: 497799835
